src/InformationRegisters/ЗастрахованныеЛицаСЭДО/ЗастрахованныеЛицаСЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗастрахованныеЛицаСЭДО</name>
  <resources>
    <name>НаОформлении</name>
    <comment>Быстрый отбор для формы рабочего места. Заполняется в процедуре ПередЗаписью.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КОтправке</name>
    <comment>Быстрый отбор для формы рабочего места. Заполняется в процедуре ПередЗаписью.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВРаботе</name>
    <comment>Быстрый отбор для формы рабочего места. Заполняется в процедуре ПередЗаписью.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТребуетсяСоздать</name>
    <comment>Заполняется на основании даты приема нового сотрудника. См. процедуру ДобавитьСведенияОНовыхСотрудниках модуля менеджера этого регистра.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТребуетсяАктуализировать</name>
    <comment>Заполняется из кадровых данных. См. регистр ОчередьОбработкиКадровыхДанныхФСС.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПоляТребующиеАктуализации</name>
    <comment>Заполняется из кадровых данных. См. регистр ОчередьОбработкиКадровыхДанныхФСС.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </resources>
  <resources>
    <name>МаксимальнаяДатаОтправки</name>
    <comment>Заполняется при изменении кадровых данных. См. регистр ОчередьОбработкиКадровыхДанныхФСС.</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоследниеСведения</name>
    <type>
      <types>DocumentRef.СведенияОЗастрахованномЛицеФСС</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеСведений</name>
    <comment>Состояние последних сведений.</comment>
    <type>
      <types>EnumRef.СостоянияДокументаСЭДОФСС</types>
    </type>
  </resources>
  <resources>
    <name>ОтправленныеСведения</name>
    <type>
      <types>DocumentRef.СведенияОЗастрахованномЛицеФСС</types>
    </type>
  </resources>
  <resources>
    <name>РегистрацияСведений</name>
    <comment>Регистрация отправленных сведений.</comment>
    <type>
      <types>DocumentRef.РегистрацияСведенийОЗастрахованномЛицеФСС</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеОтправки</name>
    <comment>Состояние отправленных сведений.</comment>
    <type>
      <types>EnumRef.СостоянияДокументаСЭДОФСС</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОтправки</name>
    <comment>Дата отправки отправленных сведений.</comment>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Скрыть</name>
    <comment>Включается по кнопке &quot;Не планируется отправлять (скрыть)&quot; списка.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаСкрытия</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоВходящихДокументов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Несоответствие</name>
    <type>
      <types>DocumentRef.НесоответствиеСведенийОЗастрахованномЛицеСЭДО</types>
    </type>
  </resources>
  <resources>
    <name>НесоответствиеСотрудникНеЧислится</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТребуетсяАннулировать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>СНИЛС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Страхователь</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ЗастрахованныеЛицаСЭДО/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	ВозможныеСостояния = Перечисления.СостоянияДокументаСЭДОФСС;
	Для Каждого Запись Из ЭтотОбъект Цикл
		Запись.КОтправке = (
			Запись.СостояниеСведений = ВозможныеСостояния.ПодготовленКОтправке
			Или Запись.СостояниеСведений = ВозможныеСостояния.ОшибкаПриОтправке);
		Запись.НаОформлении = (
			Запись.СостояниеСведений = ВозможныеСостояния.ВПроцессеПодготовки
			Или Запись.СостояниеСведений = ВозможныеСостояния.ПринятСЗамечаниями
			Или Запись.СостояниеСведений = ВозможныеСостояния.НеПринят
			Или Запись.СостояниеСведений = ВозможныеСостояния.ТребуетсяАктуализировать
			Или Запись.СостояниеСведений = ВозможныеСостояния.ТребуетсяСоздать
			Или Запись.СостояниеСведений = ВозможныеСостояния.ТребуетсяАннулировать
			Или Запись.СостояниеСведений = ВозможныеСостояния.Несоответствие);
		Запись.ВРаботе = (ЗначениеЗаполнено(Запись.СостояниеСведений)
			И Запись.СостояниеСведений <> ВозможныеСостояния.НеПланируетсяОтправлять
			И Запись.СостояниеСведений <> ВозможныеСостояния.Принят);
		Если Запись.ДатаОтправки >= Запись.МаксимальнаяДатаОтправки Тогда;
			Запись.МаксимальнаяДатаОтправки = '00010101';
		КонецЕсли;
		Если Запись.СостояниеСведений = ВозможныеСостояния.ТребуетсяСоздать
			И Запись.ПоляТребующиеАктуализации = ""
			И Не ЗначениеЗаполнено(Запись.ПоследниеСведения) Тогда
			Запись.ПоляТребующиеАктуализации = НСтр("ru = 'Требуется первичная отправка сведений';
													|en = 'Initial details sending is required'");
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли
